# GetLayerLevelType

## Description
Returns the Layer Level Type of the Layer.

```pascal
FUNCTION GetLayerLevelType(layer : HANDLE): STRING;
```

```python
def vs.GetLayerLevelType(layer):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layer|HANDLE|The Layer whose Layer Level Type is desired.|

## Examples
```pascal
VAR

layerLevelType:STRING;

BEGIN

layerLevelType := GetLayerLevelType(ActLayer);
```

```pascal
resultStr := GetLayerLevelType(layer);
```
```python
import vs

# Returns the Layer Level Type of the Layer.
layer = vs.ActLayer()  # handle to the active design layer

text = vs.GetLayerLevelType(layer)
vs.Message('GetLayerLevelType returned: ' + str(text))
```

## See Also
VS Functions:
SetLayerLevelType
| CreateLayerLevelType

## Version
Availability: from Vectorworks 2012

## Category
* Layers